--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY ډٵٰہٰيٰہہح|🌝💔                 ▀▄ ▄▀ 
▀▄ ▄▀     BYډٵٰہٰيٰہہح|🌝💔 (@ss70ss )         ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY ډٵٰہٰيٰہہح|🌝💔          ▀▄ ▄▀   
▀▄ ▄▀          dev1  : dev                 ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
—]]
do

function run(msg, matches)
return [[

االہٰبٰٰوتہٰ الہٰذيٰ يٰعملہٰ علہٰي مجوعاتہٰ الہٰسہٰوبٰٰر 🔸

يٰعملہٰ الہٰبٰٰوتہٰ علہٰي مجموعاتہٰ سہٰوبٰٰر تہٰصہٰلہٰ الہٰي5Ꮶ عضو 🔷

     ≪تہٰم صہٰنعيٰ بٰٰواسہٰطہٰه الہٰمطہٰور🙊😍≫
                      『 @llN00Nll 』
            
            『 بٰٰوتہٰ الہٰتہٰہٰواصہٰہٰلہٰہٰ🙊❤️ @T_L_N_Bot』
            
            『 CH > @Dev_TLN』
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"المطور$"
},
run = run 
}
end