--[[ 
 _   _       _   _     
|_   _| | |     | \ | |    
  | |   | |     |  \| |    
  | |   | |___  | |\  |    
  |_|   |_____| |_| \_|    
Dev @Aaa1R
Dev @llN00Nll
Dev @liknil
Dev @x_I_10_I_x
--]]

do
function run(msg, matches)
 if matches[1] == "الاوامر" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  
آؤُآمہٰہر بہٰہؤُتہ آلَہحہٰمہاييہٰهہ هہٰيہهہ ✅🔷
➖➖➖➖➖➖➖➖➖➖
♻️ م1〰 لہعہہٰرضہہ آؤُآمہٰہر آلَآدآرهہ 📝📍


♻️ م2〰 لہعہہٰرضہہ آؤُآمہٰہر آلَمہہٰيہديہآ 📝📍


♻️ م3〰 لہعہہٰرضہہہ آؤُآمہٰہر آلَحہہٰمہآيہهہ📝📍


♻️ م4〰لہعہہٰرضہہ آؤُآمہٰہر آلَمہجہٰہمہؤُعہه 📝📍


♻️ م5〰لہعہہٰرضہہ آؤُآمہہٰر آلَمہہٰطؤُر 📝📍  
➖🔴➖🔵➖⚪️➖🔴➖🔵➖                                     الاصدار ⛳️🏌 : لہٰمہٰعہٰرفہٰة مہٰوقہٰع آلآصہٰدآر 💋🚶🏻       

✋🏻تہٰآبہٰع كہٰل جہٰديہٰد ع قہٰنہٰاة آلسہٰورس 🙂🌸
[ @Dev_TLN ]🤖🎸

 آلہٰمہٰطوريہٰن :- 🙇🏻🍷👇🏿↭
- 🙇🏻🍷 
]].."\n"
.."|❗️| -------------------------- |❗️|".."\n"
..'💠- ĐέV🔰🌝: @llN00Nll  '..'\n'
..'💠- ĐέV🔰👾: @xXxDev_iqxXx  '..'\n'
..'💠- ĐέV🔰🌞: @liknil  '..'\n'
..'💠- ĐέV🔰🐉: @Aaa1R  '..'\n'
..'💠- ĐέV🔰฿๏ͳ😻🙊:@T_L_N_Bot  '..'\n'
..'💠- ĐέV🔰 Ϲḫ₳ͷͷєℓ😻🙊:@Dev_TLN  '..'\n'
------------------


elseif matches[1] == "م1" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
⚔ آؤُآمہٰہر آلَآدآرهہ 📝 تخہٰص الادمنہٰيه و المہٰدير ⚔
|⚔| 🔶🔷🔶🔷🔶🔷🔶🔷 |⚔|

|📍| رفہع ادمہن😮
|📍| لرفع ادمن رد + معرف〽️
|🛐| تنہزيل ادمہن😪
|🛐| لتنزيل ادمن رد + معرف〽️
|🤖| رفہع اداري😮
|🤖| لرفع اداري رد + معرف😌
|✅| تنہزيل اداري😒
|✅| لتنزيل اداري رد + معرف🌝
|💢| حہظر😭
|💢| حظر عضو من المجموعه😢
|✝| الغاء حہظر😏
|✝| الغہاء الحظر عن عضو😉
|❌| منہع + الكہلمه🌚
|❌| منع كلمه  🌚
|🔴| الغہاء منہع + الكلہمه😍
|⚫️| الغاء منع كلمه 😱
|🚸| قائمہه المہنع😁
|🚸| اظهار الكلمات الممنوعه😳
|🔰| تنظہٰيف قائہٰمه المہٰنع🌀🗑
|🔰| لمسح كل قائمه المنع😉🗑
|🚹| ايہدي🆔
|🚹| عرض ايہدي المجہموعه🆔
|⚜| ايدي بالرد🆔
|⚜| عرض ايدي شخص 🆔
|🚷| كتہم😶
|🚷| لكتم عضو رد + معرف + ايدي🆔😶
|⁉️| المكتہوميہن😪
|⁉️| لعرض قائمه المكتومين😶


⚜🔰⚜🔰⚜🔰⚜🔰⚜🔰⚜🔰⚜
                آلہٰمہٰطوريہٰن :- 🙇🏻🍷👇🏿↭

]].."\n"
.."|❗️| —------------------------ |❗️|".."\n"
..'💠- ĐέV🔰🌝: @llN00Nll  '..'\n'
..'💠- ĐέV🔰👾: @xXxDev_iqxXx  '..'\n'
..'💠- ĐέV🔰🌞: @liknil  '..'\n'
..'💠- ĐέV🔰🐉: @Aaa1R  '..'\n'
..'💠- ĐέV🔰฿๏ͳ😻🙊:@T_L_N_Bot  '..'\n'
..'💠- ĐέV🔰 Ϲḫ₳ͷͷєℓ😻🙊:@Dev_TLN  '..'\n'
------------------


elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔶 آؤُآمہٰہر آلَمہہٰيہديہآ 📝 قہٰفل 🔐 و فتہٰح ✅
|⚔| 🔷🔶🔷🔶🔷🔶 |⚔|
قفل + الامہٰر / للقہٰفل🔐📝
فتح + الامہٰر / للفہٰتح 🔓✅
|⚔| 🔷🔶🔷🔶🔷🔶 |⚔|

|🤖📍| الہٰصہٰوت |🗣📟
|🤖📍| الہٰصہٰور |🏝✅
|🤖📍| الہٰفيہٰديو |🎥🎈
|🤖📍| المتہٰحركه |🎡 🎐
|🤖📍| الفہٰايلات |📂 ‼️
|🤖📍| الہٰدردشه |⌨📲

♦️-------------------------------------♦️
       آلہٰمہٰطوريہٰن :- 🙇🏻🍷👇🏿↭ 
]].."\n"
.."|❗️| —------------------------ |❗️|".."\n"
..'💠- ĐέV🔰🌝: @llN00Nll  '..'\n'
..'💠- ĐέV🔰👾: @xXxDev_iqxXx  '..'\n'
..'💠- ĐέV🔰🌞: @liknil  '..'\n'
..'💠- ĐέV🔰🐉: @Aaa1R  '..'\n'
..'💠- ĐέV🔰฿๏ͳ😻🙊:@T_L_N_Bot  '..'\n'
..'💠- ĐέV🔰 Ϲḫ₳ͷͷєℓ😻🙊:@Dev_TLN  '..'\n'
------------------


elseif  matches[1] == "م3" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔶 آؤُآمہٰہر آلَحہہٰمہآيہهہ 📝‼️
⚔-----------------------------------⚔
🔒قفہٰل ,و🔓فتہٰح↭الصوت 🗣
🔒قفہٰل ,و🔓فتہٰح↭الصور 🎠
🔒قفہٰل ,و🔓فتہٰح↭الفيديو 🎥
🔒قفہٰل ,و🔓فتہٰح↭المتحركه 🎡
🔒قفہٰل ,و🔓فتہٰح↭الفايلات🗂
🔒قفہٰل ,و🔓فتہٰح↭الروابط 📤
🔒قفہٰل ,و🔓فتہٰح↭اونلاين 📍
🔒قفہٰل ,و🔓فتہٰح↭الجهات 📞
🔒قفہٰل ,و🔓فتہٰح↭التكرار ♻️
🔒قفہٰل ,و🔓فتہٰح↭الكلايش ♨️
🔒قفہٰل ,و🔓فتہٰح↭العربيه 🆎
🔒قفہٰل ,و🔓فتہٰح↭الاضافه 🚻
🔒قفہٰل ,و🔓فتہٰح↭الجماعيه👨‍👩‍👦‍👦 
🔒قفہٰل ,و🔓فتہٰح↭الاشعارات 🔔
🔒قفہٰل ,و🔓فتہٰح↭ المجموعه 🔰
🔒قفہٰل ,و🔓فتہٰح↭الملصقات 🃏
🔒قفہٰل ,و🔓فتہٰح↭التاك 🎭
🔒قفہٰل ,و🔓فتہٰح↭السمايل ♣️
🔒قفہٰل ,و🔓فتہٰح↭البوتات 🅱
🔒قفہٰل ,و🔓فتہٰح↭اعاده توجيه 🌀 
🔒قفہٰل ,و🔓فتہٰح↭المعرف 〽️
⛔️المہٰراقبة نعم او لا 🗿
⚜--------------------------------------⚜
       آلہٰمہٰطوريہٰن :- 🙇🏻🍷👇🏿↭ 
]].."\n"
.."|❗️| —------------------------ |❗️|".."\n"
..'💠- ĐέV🔰🌝: @llN00Nll  '..'\n'
..'💠- ĐέV🔰👾: @xXxDev_iqxXx  '..'\n'
..'💠- ĐέV🔰🌞: @liknil  '..'\n'
..'💠- ĐέV🔰🐉: @Aaa1R  '..'\n'
..'💠- ĐέV🔰฿๏ͳ😻🙊:@T_L_N_Bot  '..'\n'
..'💠- ĐέV🔰 Ϲḫ₳ͷͷєℓ😻🙊:@Dev_TLN  '..'\n'
------------------


elseif  matches[1] == "م4" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[  
⚫️- آؤُآمہٰہر تہٰخہٰص  ✅ آلَمہجہٰہمہؤُعہه 📝
|⚔|🔷🔶🔷🔶🔶 |⚔|

|🔴| ضہٰہع صوره🏝
|⚫️| لوضہٰع صوره 🏝
|🔴| ضہٰہع قوانين😊
|⚫️| لوضہٰع قوانين 😌
|🔴| ضہٰہع وصف🌀
|⚫️| لوضہٰع وصف  😌
|🔴| ضہٰہع اسم🖊
|⚫️| لوضہٰع اسم  🖋
|🔴| ضہٰہع  معرف〽️
|⚫️| لوضہٰع معرف 〽️
|🔴| ضہٰہع رابط🎗
|⚫️| لخہٰزن رابط المجہٰموعه🎗
|🔴| الرابہٰہط🚧
|⚫️| لعہٰرض رابط المجہٰموعه 🚧
|🔴| معلہٰومہٰاتي📝
|⚫️| لعہٰرض معلہٰوماتك📝
|🔴| معہٰلومات المجہٰموعه📠
|⚫️| لعہٰرض معہٰلومات المجموعه📠
|🔴| اعہٰدادت الوسہٰائط✉️
|⚫️| لاضہٰهار الاعہٰدادات الوسائط📩

🎴-------------------------------------🎴  
آلہٰمہٰطوريہٰن :- 🙇🏻🍷👇🏿↭ 
]].."\n"
.."|❗️| —------------------------ |❗️|".."\n"
..'💠- ĐέV🔰🌝: @llN00Nll  '..'\n'
..'💠- ĐέV🔰👾: @xXxDev_iqxXx  '..'\n'
..'💠- ĐέV🔰🌞: @liknil  '..'\n'
..'💠- ĐέV🔰🐉: @Aaa1R  '..'\n'
..'💠- ĐέV🔰฿๏ͳ😻🙊:@T_L_N_Bot  '..'\n'
..'💠- ĐέV🔰 Ϲḫ₳ͷͷєℓ😻🙊:@Dev_TLN  '..'\n'
------------------


elseif  matches[1] == "م5" and is_sudo(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
‼️✅ آؤُآمہہٰر متہٰاحہٰه لتہٰاج مخہٰي آلَہٰمہہٰطؤُر 📝 🙊🍹 
➖‼️➖➖➖📍➖➖➖‼️➖
♻️ |ترقيةه | لہٰتحـويل الـمجہٰموعه  سہٰوبہٰر ✅
✔️ |تفعيل |  لہٰتفعہٰيل البہٰوت فہٰي المہٰجہٰموعه 📍
 🚫|تعطيل | لتہٰعطہٰيل البہٰوت فہٰي المہٰجہٰموعه ➰
⚜ |رفع المدير | لہٰرفہٰع المہٰديہٰر فہٰي الہٰكروب 💟
📛 | اطفاء البوت | لآطہٰفاء البہٰوت فہٰي الكہٰروب معہٰين ‼️
💯 |تشغيل البوت | لتہٰشغيہٰل البہٰوت في الہٰكہٰروب ☢
🙀 |لطرد البوت | مہٰن الہٰكہٰروب او المجہٰموعہٰه ☮
😿 |طرد البوت | يتہٰم طہٰرد البہٰوت مہٰن الكہٰروب 💢
🔭 |اذاعہٰه+ الكلام |لنہٰشر الہٰكہٰلام في جمہٰيع الكہٰروبہٰات 🎐
🗃 |جلب ملف + اسمه | لہٰجلہٰب الملف مہٰن السہٰيرفر💯♻️
✅ |تنشيط السيرفر | لہٰتہٰنشہٰيط الہٰبہٰوت  ➿💠
🚼 | ضيف البوت + الرابط  | لضہٰافه البہٰوت عہٰن طريہٰق الرابہٰط 🆗
😈 |حظر عام | لحہٰظر الہٰعضو مہٰن جہٰميع كہٰروبات البہٰوت 🔰
⚠️ |الغاء العم |لألہٰغاء الہٰعہٰام عہٰن آلہٰعضہٰو 📝
🆔 |قائمه العام | لأضہٰهہٰار المہٰحہٰظوريہٰن عہٰام  🔐
🔏|رست | لتہٰرسيہٰت الہٰبوت مہٰن السہٰيرفر 🎛

🛢|ريديس | لتہٰعہٰديل عہٰمل البہٰوت 🚸
🔧|حدث | لہٰتحہٰديث البہٰوت 🤖📍
⚜➖➖➖➖➖⚜➖➖➖➖➖⚜
                آلہٰمہٰطوريہٰن :- 🙇🏻🍷👇🏿↭

]].."\n"
.."|❗️| —------------------------ |❗️|".."\n"
..'💠- ĐέV🔰🌝: @llN00Nll  '..'\n'
..'💠- ĐέV🔰👾: @xXxDev_iqxXx  '..'\n'
..'💠- ĐέV🔰🌞: @liknil  '..'\n'
..'💠- ĐέV🔰🐉: @Aaa1R  '..'\n'
..'💠- ĐέV🔰฿๏ͳ😻🙊: @T_L_N_Bot  '..'\n'
..'💠- ĐέV🔰 Ϲḫ₳ͷͷєℓ😻🙊: @Dev_TLN  '..'\n'
------------------
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",
    "^(م5)",
    "^[#!/](الاوامر)",
    "^[#!/](م1)",
    "^[#!/](م2)",
    "^[#!/](م3)",
    "^[#!/](م4)",
    "^[#!/](م5)"
  },
  run = run
}
end


--[[ 
 _   _       _   _     
|_   _| | |     | \ | |    
  | |   | |     |  \| |    
  | |   | |___| |\  |    
  |_|   |_____| |_| \_|    
Dev @Aaa1R
Dev @llN00Nll
Dev @liknil
Dev @x_I_10_I_x
--]]