-- made by { @llN00Nll } 
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "معليك"   
rs[1] = " شلون معليه ؟ 😒 اني #الرئاسه تآج راسك 🤖🍷 يلا كول شبيك 😂📝 "     

ws[2] = "اريد قناة" 
rs[2] = " @Dev_TLN 😌 " 

ws[3] = "نجب" 
rs[3] = "  شنو هذا يا خرا 😒 انت/ي انجب/ي يا ادب سز 🤖🍷 " 

ws[4] = "تحبني" 
rs[4] = " 😔😹 اححہب كہل النہاس بس انہت #لا " 

ws[5] = "منو"   
rs[5] = "ليش تسئل/ي ⁉️ وجه الخرا يمكن خالتك/ج 🤖😂 "  

ws[6] = "اكرهك" 
rs[6] = " 🌝🐸 دﯝلہيہ 🙄 لہٳ ٳهيہنٍكُہ😒 ٳنٍيہ ٳحہٻً  اي واحہہد  " 

ws[7] = "احبج" 
rs[7] = " لك/ج  😡 شبيك/ج 😒 راعو مشاعري حرام عليكم 😭 يلا منو يحبني يجيني خاص 🤖🍷" 

ws[8] = "واكف" 
rs[8] = " انت/ي الواكف/ة مو اني 😌 مطوري مسويني 😒🌝 " 

ws[9] = "كلخرا" 
rs[9] = " لخہاطہر #تجراسك نظہوري حسہكت ؟ 🙊🌚 " 

ws[10] = "😂" 
rs[10] = "  •❤️•فٌدِيـ❤️ــْْت هلضحكه•❤️• " 

ws[11] = "وكف البوت" 
rs[11] = " ليش تريدني اطردك/ج 😒 اني ما اوكف انت التوكف 🤖🍷 " 

ws[12] = "خاب" 
rs[12] = " ودعبل 🌝😹 بيك " 

ws[13] = "طن" 
rs[13] = "لتطنطن يمي وليدي 😒 ترا راسي دا ياذيني دي 🤖🍷 " 

ws[14] = "اكلك" 
rs[14] = " كول/ي يا بعد كلبي 😻💔 بس مو تحمى 🤖😂 " 

ws[15] = "كحاب" 
rs[15] = " امك وخواتك😈 لتجاوز تنطرد " 

ws[16] = "🐸" 
rs[16] = " 😹🌝 اشہتغل الزححہف " 

ws[17] = "ورده" 
rs[17] = "قندرتك فرده وفرده 😂 " 

ws[18] = "ريس" 
rs[18] = "ها حياتي ♯ֆ كول امر خدمه 🌸🌝 " 

ws[19] = "نظوري" 
rs[19] = " #تجہراسہك مشہغول هہسہه 🌝🕷💋" 

ws[20] = "منو مطور" 
rs[20] = "  @llN00Nll 😻🕷👄 " 

ws[21] = "هه" 
rs[21] = " وجع بكلبك/ج 😒  بلا شنو شعورك ؟ 🤖 من تكول هه 🤖⁉️ " 

ws[22] = "تف" 
rs[22] = " عليك/ج يا حيوان/ة 🙌🏽😹 اكبر/ي عيب والله 🤖🍷 " 

ws[23] = "😞" 
rs[23] = " راجہع دكہتور اخہصائي سہويت بيہه زهايمر 😐👌🏿 " 

ws[24] = "اها" 
rs[24] = " يب قابل اغشك شسالفة ضلع 😐🌝🎧 " 

ws[25] = "اه" 
rs[25] = "اوف ستحمل بس واحد بعد😞😹 " 

ws[26] = "كفو" 
rs[26] = "ميكول كفو اله الكفو تاج مخي🐲 🌝💋 " 

ws[27] = "مح" 
rs[27] = "هاي ليش تبوسني بااع الحديق حتكفر 😹💋" 

ws[28] = "كفو" 
rs[28] = "اله كفو يبو لضلوع اه 😻😹" 

ws[29] = "😂😂😂😂😂" 
rs[29] = "اي ولله سالفه اضحج 😿😹" 

ws[30] = "😂😂😂😂😂😂😂" 
rs[30] = "ضحكني وياك بس تكركر 🙄😹"

ws[31] = " منو هاي"
rs[31] = "هَـ (⊙﹏⊙) ــاآي😝الراقصه مال الكروب💃😂"

ws[32] = "اسمعي"
rs[32] = "كوووووؤ👂🏿🌝👂🏿ؤؤؤؤؤل/ي سامعك/ج"

ws[33] = "اسمع"
rs[33] = "كوووووؤ👂🏿🌝👂🏿ؤؤؤؤؤل/ي سامعك/ج "

ws[34] = "شوف"
rs[34] = "👀ششوف 👀"

ws[35] = "شسمك"
rs[35] = "اسمه اللمبــي 😹❤️"

ws[36] = " شسمج"
rs[36] = "اهوو ضل ضل ساحف كبر طمك😔😹❤️"

ws[37] = "جاو"
rs[37]  = "خليك مضوجني 😹❤️"

ws[38] = "منو بيتهوفن"
rs[38] = "😹😹😹 شوف ياربي يطلب من الحافي نعال"

ws[39] = "موسيقى"
rs[39] = "😒☝🏿️اكعد راحه بيتهوفن 😹  #اذا_ماتعرف_منو_بيتهوفن   #اكتب منو بيتهوفن"

ws[40] = "موال"
rs[40] = "🙁☝🏿️شكولي مال تحشيش ماخربها بلموال 😹❤️"

ws[41] = "ردح حزين"
rs[41] = "😹😹 مشت عليكم وين اكو ردح حزين عود هاي انته الجبير 🤑😹"

ws[42] = "ردح"
rs[42] = "😹😹😹تره رمضان قريب صلي صوم احسلك"

ws[43] = "راب"
rs[43] = "😹😹😹تره رمضان قريب صلي صوم احسلك"

ws[44] = "😘"
rs[44] = "ممنوع التقبيل في هذا الكروب 😹 هسه يزعلون الحدايق"

ws[45] = "🤔🤔"
rs[45] = "على كيفك انشتاين 😹🤘🏿"

ws[46] = "🙂"
rs[46] = "ثكيل علساس هه😪🌚"

ws[47] = "😂😂😂😂"
rs[47] = "شوف الناس وين وصلت ونته تضحك كبر يلخبل 🌚😹"

ws[48] = "نيجه"
rs[48] = "ميسوه اجب عليه 🐸😹🖕🏿"

ws[49] = "هلو"
rs[49] = "هـۣۛـۣۛــۣۛـۣۛـٰـلۣۛـۣۛــۣۛـۣۛـہۛو୭أأتۦ✿⇣💜😻🖖🏻"

ws[50] = "😂😂"
rs[50] = "مٌـظٌـحُـكِ تْـرَُه 🌚😐"

ws[51] = "شخباركم"
rs[51] = "פآلُـِْ✿ِّـلُـًِ☝️ـه عہٰايہٰشہٰيہٰن وانتہٰو شہٰخہٰباركہٰم 😻💜  "

ws[52] = "شلونكم "
rs[52] = " تٌـٌـمـ🙊ـام وانــت 🌝👌🏿"

ws[53] = "افلش"
rs[53] = "حته ارجعك بمك حبي🌝💋"

ws[54] = "شلونك"
rs[54] = "اذا اكلك زين شراح تستفاد🤔كمل عندي شغل☹️😹"

ws[55] = "🚶"
rs[55] = "شِـوَفَ ُالُـهـيَـبُّه تْـسِـطِـرَ 🙊😼"

ws[56] = "اكطع"
rs[56] = " القائد من يكول اكطع الكل تسكت✋🌚"

ws[57] = ",زاحف"
rs[57] = "حط رجلك كـ🚶ـذا وحط الثانية كـ🏃ـذا وازحـ🐢ـف ازحـ🐢ـف  كـ🐊ـذا وبربـ💃ـس بربـ💃ـس 👌😂"

ws[58] = "بوت"
rs[58] = "بوت مال #حلاقه  😂👌🏿بوت رجالي🐸👬  لو نسائي 😌👭 شهلخره بوت بوت ادري لو طالع عماله افضل مال باقي 😞وياهلعالم هاي 🐸👌🏿 عسها بحضك وبختك #بطوري  جابت ححيه ولا جابتك  🙊😌😃"

ws[59] = "مطور"
rs[59] = "@llN00Nll"

ws[60] = "تمام"
rs[60] = "{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}"

ws[61] = "ولو"
rs[61] = "شُـگـ{ôħᎯɴêȘ}ــرآآ "

ws[62] = " دوم"
rs[62] = "⌣{يـّـٌدِْۈۈ/عّزٌگ-ۈنَبْضّ قَلبْگ/ۈۈمْ}"

ws[63] = "هلا"
rs[63] = "✾  هـﮩـڵا ہبـﮩـک 💙🖐🏻"

ws[64] = "مرحبا"
rs[64] = " مراحب💜 اغــاتي نــورت/ي 😻 شمــعةۿ ڪـل۪ۧـ﴿💕﴾ــٍّﺒـي🙊💕"

ws[65] = "سلام"
rs[65] = " ✾ ٲلـﮩـسـلا۾م ؏ـﮩـڵـيڪم  💙🖐🏻"

ws[66] = "السلام"
rs[66] = "✾ ٲلـﮩـسـلا۾م ؏ـﮩـڵـيڪم  💙🖐🏻"

ws[67] = "السلام عليكم"
rs[67] = "✾ وَْ؏ـﮩـڵـيڪم ٲلـﮩـسـلا۾م 💙🖐🏻"

ws[68] = "هلاوو"
rs[68] = "هـﮩـڵآوآت 🦀❤️"

ws[69] = "شباب"
rs[69] = "هًّـــُ﴿⍨﴾ـٍِـــہاا حـﮩـب 🐸👌🏿"

ws[70] = "فديتك"
rs[70] = "خاف اكلك/ج اموت😻 عليك/ج وتالي تعوفني😹🖖💕"

ws[71] = "🌝" 
rs[71] = "مــﮩﮩﮩــننوورر 🐸💋"

ws[72] = "نعال" 
rs[72] = " بـﮩـوجـهـڪ 😐😂"

ws[73] = "☹️"
rs[73] = "☹️ليش حلو ضايج 😞شبيك/ج 😢 فدوه اضحك/ي الخطري 😍💋"

ws[74] = "غنيلي" 
rs[74] = "شتحب تسمع (راب_حزين_شعر_ردح_ردح حزين _ موال_ موسيقى ) \n كيفك انته وذوقك 😌❤️"

ws[75] = "اكلك" 
rs[75] = " ڪـﮩﮩۛﮩـوڵ مـاكـوڵ لٱحـﮩـد 🐸❤️"

ws[76] = "دي" 
rs[76] = "دي تنـڪاڵ لـبوك 🌝🖕"

ws[77] = "ضلع"
rs[77] = "انجب/ي لك/ج 😒⁉️ لتتلوك مو ضلعك/ج اني 😂🍷"
  
ws[78] = "يا سورس هذا"
rs[78] = "ادخل للقناة 🙊 @Dev_TLN وشوف المطور 😂🚶🏻"

ws[79] = "باي"
rs[79] = "  تـوصـل بل سـلامـه ✾ ٱ ٱڵـڵـه وياك 🕊🙊 "

ws[80] = "/help" 
rs[80] ="لظهار لاوامر دز الاوامر😍❤️"

ws[81] = "جوعان"
rs[81] = "تـﮩـعال اڪـﮩـلنـي 😐😂"

ws[82] = "😔"
rs[82] = "لـﮩـيـﺵ ضـٲيـﮩـج 😿🖖🏿"

ws[83] = "حلو" 
rs[83] = "ٱنـﮩـت الاحـلآ 🌚❤️"

ws[84] = "😒"
rs[84] = "😐 شبيك كالب وجهك "

ws[85] = "الرئاسه"
rs[85] = "اســۣۛـۣۛـيــۣۛـۣۛـادك 🐸🖕🏿بطــۣۛـۣۛـي 🐎 تاج راســۣۛـۣۛـك حاميــۣۛـۣۛـن اعراضــۣۛـۣۛـك✿⇣🌞💋"

ws[86] = "🙃"
rs[86] = "ولخلقه 😐😂"

ws[87] = "اريد بوت"
rs[87] = "؏ـيــ❦ـوني 🙊 راســل احد المــطورين 🤖👇🏿 يكون كروبك فوك  300 🌚  و @llN00Nll او @liknil او @Aaa1R او @x_I_10_I_x"

ws[88] = "🌚" 
rs[88] = "هاك صابونةه 🚿 اغسل وجهكك 😳😹🏃🏿"

ws[89] = "تيم" 
rs[89] = "مــہٰٰـــو بحــہٰٰـــالكے القــہٰٰـائــہٰٰـد 🎤🚶"

ws[90] = "تيبارا" 
rs[90] = "مــہٰٰـــو بحــہٰٰـــالكے القــہٰٰـائــہٰٰـد 🎤🚶"

ws[91] = "انور" 
rs[91] = "هہٰٰذا بہٰٰطہٰٰوري وحہٰٰبہٰٰيب كلہٰٰبي @x_I_10_I_x 🙊🌸"

ws[92] = "كرار" 
rs[92] = "هہٰٰذا بہٰٰطہٰٰوري وحہٰٰبہٰٰيب كلہٰٰبي @liknil 🙊🌸"

ws[93] = "علاوي" 
rs[93] = "هہٰٰذا بہٰٰطہٰٰوري وحہٰٰبہٰٰيب كلہٰٰبي @Aaa1R 🙊🌸"

ws[94] = "وليد" 
rs[94] = "هہٰٰذا بہٰٰطہٰٰوري وحہٰٰبہٰٰيب كلہٰٰبي @w_Dev_d 🙊🌸"

ws[95] = "زعيم" 
rs[95] = "هہٰٰذا بہٰٰطہٰٰوري وحہٰٰبہٰٰيب كلہٰٰبي @llN00Nll 🙊🌸"

ws[96] = "شنو" 
rs[96] = "اي 😪مثل ماسمعت👀"

ws[97] = "شنو" 
rs[97] = "اي 😪مثل ماسمعت👀"

ws[98] = "ليث"
rs[98] = " #تہٰٰجہٰٰراسہٰٰك (@lI3l3Il )ليہٰٰث ابہٰٰن العہٰٰراق  🐸💋"

ws[99] = "."
rs[99] = " ينزل رابط الكروب بل تعديل لا يا خرا 💦☹️🚶🏿"

ws[100] = "هلاو" 
rs[100] =  "هلاوو99وووات نورت/ي 👌🏿😂" 

ws[101] = "😳"
rs[101] = "🙌🏽😹شـبــيــك😒مصـــدوم🌝وجـــ التنــكـــه😏" 

ws[102] = "هاي"
rs[102] = "هايات 🌝❤️ يروحي 👌🏿 نورت/ي ورد 🍃"

ws[103] = "شلونكم"
rs[103] = "تٌـٌـمـ🙊ـام وانــت 🌝👌🏿"

ws[104] = "😂😂😂"
rs[104] = "🙄🙄 راح يخرب من الضحك كبر يي والله وجهك يفشل 😹 امداك 🙌🙌👌"

ws[105] = "زاحف"
rs[105] = "حط رجلك كـ🚶ـذا وحط الثانية كـ🏃ـذا وازحـ🐢ـف ازحـ🐢ـف  كـ🐊ـذا وبربـ💃ـس بربـ💃ـس 👌😂"

ws[106] = "البوت"
rs[106] = "معاجبك ؟ 😕😒🍃"

ws[107] = "خالتك" 
rs[107] = "هَـ (⊙﹏⊙) ــاآك😝افلوس💵جيبلي خالتك😂"

ws[108] = "😂😂😂😂😂😂😂" 
rs[108] = "ضحكني وياك بس تكركر 🙄😹"

ws[109] = "منو اني"
rs[109] = "انته احلى شي بحياتي ❤️🍃"

ws[110] = "وينك" 
rs[110] = "بالــســ🚗ــيــارﮭﮧ" 

-- the main function
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "li_xXx_il" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @li_xXx_il" ); 
      end

end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end